package com.example.helloworld.enumdata;

public enum TopGetTimeZoneTypeEnum {

    KLT,//  +14:00 基里巴斯线岛时间
    NZDT,//   		+13:00	新西兰夏令时
    IDLE,//   		+12:00	国际日期变更线,东边
    NZST,//   		+12:00	新西兰标准时间
    NZT,//   		+12:00	新西兰时间
    AESST,//   	+11:00	澳大利亚东部夏时制
    ACSST,//   	+10:30	中澳大利亚标准时间
    CADT,//   	+10:30	中澳大利亚夏时制
    SADT,//   	+10:30	南澳大利亚夏时制
    EAST,//   	+10:00	东澳大利亚标准时间
    GST,//   	+10:00	关岛标准时间
    LIGT,//   	+10:00	澳大利亚墨尔本时间
    CAST,//     +9:30	中澳大利亚标准时间
    SAST,//     	+9:30	南澳大利亚标准时间
    AWSST,//     	+9:00	澳大利亚西部标准夏令时
    JST,//     	+9:00	日本标准时间
    KST,//     	+9:00	韩国标准时间
    MT,//     	+8:30	毛里求斯时间
    AWST,//     	+8:00	澳大利亚西部标准时间
    CCT,//     	+8:00	中国沿海时间(北京时间)
    WST,//  +08:00 西澳大利亚标准时间
    JT,//   +07:30 爪哇时间
    ALMST,//   +07:00 阿拉木图夏令时
    CXT,//   +07:00 澳大利亚圣诞岛时间
    MMT,//   +06:30 缅甸时间
    ALMT,//   +06:00 哈萨克斯坦阿拉木图时间
    IST2, //  +5:30 印度标准时间
    IOT,//   +05:00 英属印度洋领地时间
    MVT,//   +05:00 马尔代夫时间
    TFT,//   +05:00 法属凯尔盖朗岛时间
    AFT,//   +04:30 阿富汗时间
    MUT,//   +04:00 毛里求斯时间
    RET,//   +04:00 法属留尼汪岛时间
    SCT,//   +04:00 塞舌尔马埃岛时间
    IT,//     	+3:30	伊朗时间
    BT,//     	+3:00	巴格达时间
    EETDST,//     	+3:00	东欧夏时制(俄罗斯莫斯科时区)
    CETDST,//     	+2:00	中欧夏时制
    EET,//     	+2:00	东欧
    FWT,//     	+2:00	法国冬时制
    IST,//     	+2:00	以色列标准时间
    MEST,//     	+2:00	中欧夏时制
    METDST,//     	+2:00	中欧白昼时间
    SST,//     	+2:00	瑞典夏时制
    BST,//     	+1:00	英国夏时制
    CET,//     	+1:00	中欧时间
    DNT,//     +01:00 丹麦正规时间
    FST,//     	+1:00	法国夏时制
    MET,//     	+1:00	中欧时间
    MEWT,//     	+1:00	中欧冬时制
    MEZ,//     	+1:00	中欧时区
    NOR,//     	+1:00	挪威标准时间
    SWT,//     	+1:00	瑞典冬时制
    WETDST,//     	+1:00	西欧光照利用时间（夏时制）
    UST,	//	0:00  协调世界时间
    GMT,//     	0:00		格林威治标准时间
    WET,//     	0:00		西欧
    WAT,//     	-1:00		西非时间
    FNST,//    -01:00 巴西费尔南多·迪诺罗尼亚岛夏令时
    FNT,//    -02:00 巴西费尔南多·迪诺罗尼亚岛时间
    BRST,//   -02:00 巴西利亚夏令时
    NDT,//     	-2:30		纽芬兰（新大陆）白昼时间
    ADT,//     	-3:00		大西洋白昼时间
    BRT,//   -03:00 巴西利亚时间
    NFT,//     	-3:30		纽芬兰（新大陆标准时间
    AST,//     	-4:00		大西洋标准时间（加拿大）
    ACST,//     -04:00 大西洋阿雷格里港 夏令时
    EDT,//     	-4:00	（美国)东部夏令时
    ACT,//   -05:00 大西洋阿雷格里港标准时间
    CDT,//     	-5:00	（美国)中部夏令时
    EST,//     	-5:00	（美国)东部标准时间
    CST,//     	-6:00	（美国)中部标准时间
    MDT,//     	-6:00		（美国)山地夏令时
    MST,//     	-7:00		（美国)山地标准时间
    PDT,//     	-7:00	（美国)太平洋夏令时
    PST,//     	-8:00	（美国)太平洋标准时间
    YDT,//     	-8:00		育空地区夏令时
    HDT,//     	-9:00		夏威夷/阿拉斯加白昼时间
    YST,//     	-9:00		育空地区标准时
    AHST,//   	-10:00	夏威夷-阿拉斯加标准时间
    CAT,//   	-10:00	中阿拉斯加时间
    NT,//   	-11:00	州时间（诺姆时间）
    IDLW//   -12:00	国际日期变更线，西边
}


